using Steam_TripleBrain.Models;

namespace Steam_TripleBrain.Repositories.Interface
{
    public interface ITokenLogRepository
    {
        Task AddAsync(TokenLogs log);                                 // Додавання нового запису про токен
        Task<IEnumerable<TokenLogs>> GetByUserAsync(string username); // Отримання всіх записів про токени для конкретного користувача
                                                                      // IEnumerable це інтерфейс, який представляє колекцію об'єктів, що може бути перебрана.
                                                                      // Він дозволяє отримувати елементи колекції один за одним, не надаючи можливості змінювати колекцію.
        Task<TokenLogs> GetByTokenAsync(string token);                // Отримання запису про токен за його значенням
        Task RevokeAsync(string token);                               // Метод для відкликання токена (наприклад, при виході користувача або виявленні компрометації)
                                                                      // компрометація - це коли зловмисник отримує несанкціонований доступ до токена,
                                                                      // що може призвести до несанкціонованого доступу до ресурсів або даних користувача.
                                                                      // Відкликання токена допомагає запобігти цьому, позначаючи його як недійсний у базі даних,
                                                                      // що дозволяє системі відмовляти в доступі при спробі використання такого токена.
    }
}
